zhjiehua/PMSM/STM32 PMSM FOC LIB/Web/PFC_Application/src/STM32F30x_PFCInit.c
/**
  ******************************************************************************
  * @file    STM32F30x_PFCInit.c
  * @author  STMicroelectronics - GCSA - IPD Motion Control Team - Shenzhen
  * @version 4.3.0
  * @date    22-Sep-2016 15:29
  * @brief   This file contains interface of PFC Module specific for STM32F3
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2016 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "MC_type.h"
#include "PWMnCurrFdbkClass.h"
#include "PIRegulatorClass.h"
#include "StateMachineClass.h"
#include "MCTuningClass.h"
#include "MCInterfaceClass.h"

#include "STM32F30x_PFCApplication.h"
#include "Parameters conversion.h"

#if defined(PFC_ENABLED)

#include "PFCParameters.h"
#include "PFCInit.h"

#define TIMCK_NS ((1.0/TIM_CLK)*1000000000.0) /*!< duration of TIM clock period, ns*/

#undef NONE
#undef EXT_MODE
#undef INT_MODE
#define NONE		0x00
#define EXT_MODE 	0x01
#define INT_MODE 	0x02

#if (PFC_USE_INTERNAL_OPAMP == ENABLE)
  #define PFC_OPAMP_PARAMS &PFC_OpAmpParams
#else
  #define PFC_OPAMP_PARAMS MC_NULL
  #warning "PFC EXT OPAMP"
#endif

#if (PFC_BKIN_MODE == INT_MODE)
  #define OCP_PFC1_PARAMS  &OCP_PFC_params1
#else
  #define OCP_PFC1_PARAMS MC_NULL
  #warning "PFC EXT COMP or NONE"
#endif

#undef NONE
#undef EXT_MODE
#undef INT_MODE
#define NONE		((uint8_t)(0x00))
#define EXT_MODE 	((uint8_t)(0x01))
#define INT_MODE 	((uint8_t)(0x02))

/**
  * @brief  Internal COMP parameters PFC 1 - F30x - OCP
  */
F30XCOMPParams_t OCP_PFC_params1 =
{
  OCP_PFC_SELECTION,          /*!< Internal comparator used for protection.
                                   It must be
                                   COMP_Selection_COMPx x = 1,2,3,4,5,6,7.*/
  OCP_PFC_INVERTINGINPUT_MODE,/*!< COMPx inverting input mode. It must be either
                                   equal to EXT_MODE or INT_MODE. */
  OCP_PFC_INVERTINGINPUT,     /*!< COMPx inverting input pin. It must be one of
                                   the following:
                                   COMP1_InvertingInput_PA0,
                                   COMP2_InvertingInput_PA2,
                                   COMP3_InvertingInput_PD15,
                                   COMP3_InvertingInput_PB12,
                                   COMP4_InvertingInput_PE8,
                                   COMP4_InvertingInput_PB2,
                                   COMP5_InvertingInput_PD13,
                                   COMP5_InvertingInput_PB10,
                                   COMP6_InvertingInput_PD10,
                                   COMP6_InvertingInput_PB15 if
                                   bInvertingInput_MODE is EXT_MODE or
                                   COMPX_InvertingInput_DAC1,
                                   COMPX_InvertingInput_DAC2,
                                   COMPX_InvertingInput_VREF,
                                   COMPX_InvertingInput_VREF_1_4,
                                   COMPX_InvertingInput_VREF_1_2,
                                   COMPX_InvertingInput_VREF_3_4 if
                                   bInvertingInput_MODE is INT_MODE.
                                   If bInvertingInput_MODE is EXT_MODE, the
                                   only available options are related to the
                                   selected COMP in wSelection.*/
  OCP_PFC_INVERTINGINPUT_GPIO_PORT,/*!< COMPx inverting input GPIO port as defined in
                                   wInvertingInput (Just if
                                   bInvertingInput_MODE is EXT_MODE).
                                   It must be GPIOx x= A, B, ...*/
  OCP_PFC_INVERTINGINPUT_GPIO_PIN,/*!< COMPx inverting input GPIO pin as defined in
                                   wInvertingInput (Just if
                                   bInvertingInput_MODE is EXT_MODE).
                                   It must be GPIO_Pin_x x= 0, 1, ...*/
  OCP_PFC_NONINVERTINGINPUT,  /*!< COMPx non inverting input. It must be one of
                                   the following:
                                   COMP1_NonInvertingInput_PA1,
                                   COMP2_NonInvertingInput_PA3,
                                   COMP2_NonInvertingInput_PA7,
                                   COMP3_NonInvertingInput_PB14,
                                   COMP3_NonInvertingInput_PD14,
                                   COMP4_NonInvertingInput_PB0,
                                   COMP4_NonInvertingInput_PE7,
                                   COMP5_NonInvertingInput_PB13,
                                   COMP5_NonInvertingInput_PD12,
                                   COMP6_NonInvertingInput_PB11,
                                   COMP6_NonInvertingInput_PD11,
                                   COMP7_NonInvertingInput_PC1,
                                   COMP7_NonInvertingInput_PA0.
                                   The only available options are related to the
                                   selected COMP in wSelection.*/
  OCP_PFC_NONINVERTINGINPUT_GPIO_PORT, /*!< COMPx non inverting input GPIO port as
                                   defined in wNonInvertingInput.
                                   It must be GPIOx x= A, B, ...*/
  OCP_PFC_NONINVERTINGINPUT_GPIO_PIN,  /*!< COMPx non inverting input GPIO pin as defined
                                   in wNonInvertingInput.
                                   It must be GPIO_Pin_x x= 0, 1, ...*/
  OCP_PFC_OUTPUT_MODE,        /*!< COMPx output. It must be either
                                   equal to EXT_MODE or INT_MODE. */
  OCP_PFC_OUTPUT,             /*!< COMPx output selection. It must be one of
                                   the following:
                                   COMP_Output_TIM1BKIN,
                                   COMP_Output_TIM1BKIN2,
                                   COMP_Output_TIM8BKIN,
                                   COMP_Output_TIM8BKIN2,
                                   COMP_Output_TIM1BKIN2_TIM8BKIN2.*/
  OCP_PFC_OUTPUT_GPIO_PORT,   /*!< COMPx output GPIO port.
                                   It must be GPIOx x= A, B, ...*/
  OCP_PFC_OUTPUT_GPIO_PIN,    /*!< COMPx output GPIO pin as defined.
                                   It must be GPIO_Pin_x x= 0, 1, ...*/
  OCP_PFC_OUTPUT_GPIO_AF,     /*!< COMPx output alternate functions setting.
                                   It must be one of the GPIO_AF_x (x=0,1, ...)
                                   according to the defined GPIO port and pin.*/
  OCP_PFC_OUTPUTPOL,          /*!< COMPx output polarity. It must be one of
                                   the following:
                                   COMP_OutputPol_NonInverted,
                                   COMP_OutputPol_Inverted.*/
  OCP_PFC_FILTER,             /*!< COMPx mode it is used to define both
                                   the speed (analog filter) and
                                   the power consumption of the internal
                                   comparator. It must be one of the
                                   following:
                                   COMP_Mode_HighSpeed,
                                   COMP_Mode_MediumSpeed,
                                   COMP_Mode_LowPower,
                                   COMP_Mode_UltraLowPower.
                                   More speed means less filter and more
                                   consumption.*/

