zhjiehua/PMSM/STM32 PMSM FOC LIB/Web/PFC_Application/src/STM32F30x_PFCInit.c
};

PFC_R3_4_F30XOPAMPParams_t PFC_OpAmpParams =
{
  /* Internal OPAMP1 settings --------------------------------------------------*/
  PFC_OPAMP_SELECTION,		            /*!< First OPAMP selection. It must be
                                           either equal to
                                           OPAMP_Selection_OPAMP1 or
                                           OPAMP_Selection_OPAMP3.*/
  PFC_OPAMP_INVERTINGINPUT_MODE,      /*!< First OPAMP inverting input mode.
                                           It must be either equal to EXT_MODE
                                           or INT_MODE.*/
  PFC_OPAMP_INVERTINGINPUT,           /*!< First OPAMP inverting input pin.

                                           If wOPAMP_Selection is
                                           OPAMP_Selection_OPAMP1 it
                                           must be one of the following:
                                           OPAMP1_InvertingInput_PC5 or
                                           OPAMP1_InvertingInput_PA3 if the
                                           bOPAMP_InvertingInput_MODE is
                                           EXT_MODE or
                                           OPAMP1_InvertingInput_PGA or
                                           OPAMP1_InvertingInput_FOLLOWER if the
                                           bOPAMP_InvertingInput_MODE is
                                           INT_MODE.

                                           If wOPAMP_Selection is
                                           OPAMP_Selection_OPAMP3 it
                                           must be one of the following:
                                           OPAMP3_InvertingInput_PB10 or
                                           OPAMP3_InvertingInput_PB2 if the
                                           bOPAMP_InvertingInput_MODE is
                                           EXT_MODE or
                                           OPAMP3_InvertingInput_PGA or
                                           OPAMP3_InvertingInput_FOLLOWER if the
                                           bOPAMP_InvertingInput_MODE is
                                           INT_MODE.*/
  PFC_OPAMP_INVERTINGINPUT_GPIO_PORT, /*!< First OPAMP inverting input GPIO port
                                           as defined in wOPAMP_InvertingInput.
                                           It must be GPIOx x= A, B, ... if
                                           bOPAMP_InvertingInput_MODE is
                                           EXT_MODE, otherwise can be dummy.*/
  PFC_OPAMP_INVERTINGINPUT_GPIO_PIN,  /*!< First OPAMP inverting input GPIO pin
                                           as defined in wOPAMP_InvertingInput.
                                           It must be GPIO_Pin_x x= 0, 1, ... if
                                           bOPAMP_InvertingInput_MODE is
                                           EXT_MODE, otherwise can be dummy.*/
  PFC_OPAMP_NONINVERTINGINPUT,        /*!< First OPAMP non inverting input first
                                           selection.

                                           If wOPAMP_Selection is
                                           OPAMP_Selection_OPAMP1 it
                                           must be one of the following:
                                           OPAMP1_NonInvertingInput_PA7,
                                           OPAMP1_NonInvertingInput_PA5,
                                           OPAMP1_NonInvertingInput_PA3,
                                           OPAMP1_NonInvertingInput_PA1.

                                           If wOPAMP_Selection is
                                           OPAMP_Selection_OPAMP3 it
                                           must be one of the following:
                                           OPAMP3_NonInvertingInput_PB13,
                                           OPAMP3_NonInvertingInput_PA5,
                                           OPAMP3_NonInvertingInput_PA1,
                                           OPAMP3_NonInvertingInput_PB0.*/
  PFC_OPAMP_NONINVERTINGINPUT_GPIO_PORT,
                                      /*!< First OPAMP non inverting input GPIO
                                           port as defined in
                                           wOPAMP_NonInvertingInput_PHA.
                                           It must be GPIOx x= A, B, ...*/
  PFC_OPAMP_NONINVERTINGINPUT_GPIO_PIN,
                                      /*!< First OPAMP non inverting input GPIO
                                           pin as defined in
                                           wOPAMP_NonInvertingInput_PHA.
                                           It must be GPIO_Pin_x x= 0, 1, ...*/

  PFC_OPAMP_OUT_GPIO_PORT,
                                      /*!< First OPAMP output GPIO port.
                                           It must be GPIOx x= A, B, ...
                                           Note: Output pin is PA2 for OPAMP1,
                                           PB1 for OPAMP3.*/
  PFC_OPAMP_OUT_GPIO_PIN,
                                      /*!< First OPAMP output GPIO pin.
                                           It must be GPIO_Pin_x x= 0, 1, ...
                                           Note: Output pin is PA2 for OPAMP1,
                                           PB1 for OPAMP3.*/
/* Common settings -----------------------------------------------------------*/
  PFC_OPAMP_PGAGAIN,                  /*!< It defines the OPAMP PGA gains.
	                                         It must be one of the following:
                                           OPAMP_OPAMP_PGAGain_2,
                                           OPAMP_OPAMP_PGAGain_4,
                                           OPAMP_OPAMP_PGAGain_8,
                                           OPAMP_OPAMP_PGAGain_16.
                                           This value is taken in account
                                           just if wOPAMPx_InvertingInput is
                                           equal to OPAMP2_InvertingInput_PGA*/
  PFC_OPAMP_PGACONNECT                    /*!< It defines the OPAMP connection
                                           with an external filter when PGA
                                           is enabled.
                                           It must be one of the following:
                                           OPAMP_PGAConnect_No,
                                           OPAMP_PGAConnect_IO1,
                                           OPAMP_PGAConnect_IO2.
                                           See reference manual RM0316.
                                           This value is taken in account
                                           just if wOPAMPx_InvertingInput is
                                           equal to OPAMP2_InvertingInput_PGA*/

